
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();

    Для Каждого Строка Из Выплаты Цикл

        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Сотрудник = Строка.Сотрудник;
        Движение.Сумма = Строка.Сумма;
        Движение.Период = Дата;

    КонецЦикла;
КонецПроцедуры
