Процедура ДополнитьФорму(Форма) Экспорт

//Если Справочники.ДоговорыКонтрагентов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		ПолеВвода = Форма.Элементы.Добавить("ПериодДействияДоговора", Тип("ПолеФормы"), Форма);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговора";
		
	    ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Форма);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		
		ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		
	    
//КонецЕсли;
	
	
КонецПроцедуры



