
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
  Если ОбменДанными.Загрузка Тогда 
  	Возврат;
  КонецЕсли;
	
	
		Если Не ЭтоНовый() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
				|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
				|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот
				|ИЗ
				|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
				|ГДЕ
				|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СтараяДата = ВыборкаДетальныеЗаписи.Дата;
				СтароеВремяНачалаРабот = ВыборкаДетальныеЗаписи.ВремяНачалаРабот;
				СтарыйСпециалист = ВыборкаДетальныеЗаписи.Специалист;
			КонецЕсли;
		Если СтараяДата <> Дата Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Изменена дата (было %1, стало %2" ,СтараяДата, Дата);  
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если СтароеВремяНачалаРабот <> ВремяНачалаРабот Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Изменен ВремяНачалаРабот (было %1, стало %2", СтароеВремяНачалаРабот, ВремяНачалаРабот);  
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если СтарыйСпециалист <> Специалист Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Изменен Специалист (был %1, стал %2", СтарыйСпециалист, Специалист);  
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ПериодДействияДоговора КАК ДоговорВКМ_ПериодДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК ДоговорВКМ_СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблица1
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И
	|		ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица1.Дата КАК Дата,
	|	ВременнаяТаблица1.ДоговорВКМ_СтоимостьЧасаРаботы КАК ДоговорВКМ_СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВременнаяТаблица1.ДоговорВКМ_ПериодДействияДоговора КАК ДоговорВКМ_ПериодДействияДоговора,
	|	ВременнаяТаблица1.Клиент КАК Клиент,
	|	ВременнаяТаблица1.Договор КАК Договор
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы,
	|	ВременнаяТаблица1 КАК ВременнаяТаблица1";

Запрос.УстановитьПараметр("Ссылка", Ссылка);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;

		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ДоговорВКМ_СтоимостьЧасаРаботы * ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту
	КонецЦикла;


КонецПроцедуры








