
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
  Если ОбменДанными.Загрузка Тогда 
  	Возврат;
  КонецЕсли;
	
	
		Если Не ЭтоНовый() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
				|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
				|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот
				|ИЗ
				|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
				|ГДЕ
				|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СтараяДата = ВыборкаДетальныеЗаписи.Дата;
				СтароеВремяНачалаРабот = ВыборкаДетальныеЗаписи.ВремяНачалаРабот;
				СтарыйСпециалист = ВыборкаДетальныеЗаписи.Специалист;
			КонецЕсли;
		Если СтараяДата <> Дата Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Изменена дата (было %1, стало %2" ,СтараяДата, Дата);  
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если СтароеВремяНачалаРабот <> ВремяНачалаРабот Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Изменен ВремяНачалаРабот (было %1, стало %2", СтароеВремяНачалаРабот, ВремяНачалаРабот);  
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если СтарыйСпециалист <> Специалист Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Изменен Специалист (был %1, стал %2", СтарыйСпециалист, Специалист);  
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)


	Если НЕ ЗначениеЗаполнено(Договор) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не указан договор.";
		        Сообщение.Сообщить();
		        Отказ = Истина;
				Возврат;
	КонецЕсли;
	
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ВидДоговора,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ПериодДействияДоговора КАК ПериодДействияДоговора,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
	Если ВыборкаДетальныеЗаписи.ВидДоговора
			<> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Договор должен иметь вид 'Абонентская плата'.";
		        Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	ДатаДок = НачалоДня(Дата);
	
	
	Если ДатаДок < ВыборкаДетальныеЗаписи.ПериодДействияДоговора ИЛИ ДатаДок > ВыборкаДетальныеЗаписи.ПериодДействияДоговора Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата документа  выходит за пределы срока действия договора ";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	Движения.ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВыполненныеКлиентуРаботы.Очистить();
	
	СтавкаЧаса = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
	
	Для Каждого СтрокаТЧ Из ВыполненныеРаботы Цикл
		
		Если СтрокаТЧ.ЧасыКОплатеКлиенту = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение                  = Движения.ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения      = ВидДвиженияНакопления.Приход;
		Движение.Период           = Дата;
		Движение.Клиент           = Клиент;
		Движение.Договор          = Договор;
		Движение.КоличествоЧасов  = СтрокаТЧ.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате     = СтрокаТЧ.ЧасыКОплатеКлиенту * СтавкаЧаса;
		
	КонецЦикла;
	
КонецЦикла;

КонецПроцедуры








