

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	РаботаСФайлами.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
КонецПроцедуры




