
&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресДанных = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);

   
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
    ПараметрыФормы.Вставить("Год", Объект.Год);
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ОбновитьУсловноеОформление();
	 
КонецПроцедуры

&НаСервере
Процедура ОбновитьУсловноеОформление()

    Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
        Длительность = (Строка.ДатаОкончания - Строка.ДатаНачала) + 1;
        Если Длительность > 28 Тогда
            
           Элементы.ОтпускаСотрудников.УсловноеОформление.Оформления.НачатьУстановку();
           Строка.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый);
           
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры
