
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_ДополнительныеНачисления.Очистить();
    Движения.ВКМ_Удержания.Записывать = Истина;
    Движения.ВКМ_Удержания.Очистить();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();

    НачалоМесяца = НачалоМесяца(Дата);
    КонецМесяца = КонецМесяца(Дата);

    Для Каждого Строка Из СписокСотрудников Цикл

        
        Если Строка.Сумма > 0 Тогда
            Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
            Движение.Сотрудник = Строка.Сотрудник;
            Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
            Движение.Результат = Строка.Сумма;
            Движение.ПериодДействияНачало = НачалоМесяца;
            Движение.ПериодДействияКонец = КонецМесяца;
            Движение.ПериодРегистрации = Дата;

            // НДФЛ
            СуммаНДФЛ = Строка.Сумма * 0.13;
            ДвижениеУ = Движения.ВКМ_Удержания.Добавить();
            ДвижениеУ.Сотрудник = Строка.Сотрудник;
            ДвижениеУ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
            ДвижениеУ.Результат = СуммаНДФЛ;
            ДвижениеУ.ПериодДействияНачало = НачалоМесяца;
            ДвижениеУ.ПериодДействияКонец = КонецМесяца;
            ДвижениеУ.ПериодРегистрации = Дата;

            // Взаиморасчеты
            ДвижениеВ = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
            ДвижениеВ.ВидДвижения = ВидДвиженияНакопления.Приход;
            ДвижениеВ.Сотрудник = Строка.Сотрудник;
            ДвижениеВ.Сумма = Строка.Сумма - СуммаНДФЛ;
            ДвижениеВ.Период = Дата;
        КонецЕсли;

    КонецЦикла;
КонецПроцедуры
