
Процедура ВКМ_ОтправкаУведомленийВTelegram() Экспорт
	Токен = Константы.ВКМ_ТокенТелеграмБота.Получить();
    Чат = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
    Если ПустаяСтрока(Токен) Или ПустаяСтрока(Чат) Тогда
        Возврат;
    КонецЕсли;

    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ Ссылка, ТекстСообщения ИЗ Справочник.УведомленияТелеграмБоту";
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();


    СсылкиДляУдаления = Новый Массив;

    Пока Выборка.Следующий() Цикл
        Ссылка = Выборка.Ссылка;
        Текст = Выборка.ТекстСообщения;

        Если ВКМ_ТелеграмБот.ОтправитьСообщение(Текст) Тогда
            СсылкиДляУдаления.Добавить(Ссылка);
        КонецЕсли;
    КонецЦикла;

 
    Для Каждого Ссылка Из СсылкиДляУдаления Цикл
        Попытка
            Элемент = Ссылка.ПолучитьОбъект();
            Если Элемент <> Неопределено Тогда
                Элемент.Удалить();
            КонецЕсли;
        Исключение
            ЗаписьЖурналаРегистрации("Ошибка удаления уведомления", УровеньЖурналаРегистрации.Ошибка,,,
                "Не удалось удалить элемент " + Ссылка + ": " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры
