&НаСервере
Процедура ЗаполнитьПоОстаткам()

    Объект.Выплаты.Очистить();

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
        |	ВКМ_ВзаиморасчетыССотрудниками.Сумма КАК Сумма
        |ИЗ
        |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками КАК ВКМ_ВзаиморасчетыССотрудниками
        |ГДЕ
        |	ВКМ_ВзаиморасчетыССотрудниками.Сумма > 0
        |	И ВКМ_ВзаиморасчетыССотрудниками.МоментВремени = &Дата";
        
    Запрос.УстановитьПараметр("Дата", Объект.Дата);
    Результат = Запрос.Выполнить().Выбрать();

    Пока Результат.Следующий() Цикл
        НоваСтрока = Объект.Выплаты.Добавить();
        НоваСтрока.Сотрудник = Результат.Сотрудник;
        НоваСтрока.Сумма = Результат.Сумма;
    КонецЦикла;

КонецПроцедуры